{"meta":{"title":"Peter's Place","subtitle":"/home/blog/","description":"code life balance.","author":"Peter Wang","url":"https://peterwe2.github.io","root":"/"},"pages":[{"title":"about","date":"2020-08-16T12:56:24.000Z","updated":"2020-08-16T12:56:58.668Z","comments":true,"path":"about/index.html","permalink":"https://peterwe2.github.io/about/index.html","excerpt":"","text":""}],"posts":[{"title":"讀書-把時間當作朋友","slug":"讀書-把時間當作朋友","date":"2020-09-27T12:47:49.000Z","updated":"2020-10-06T12:43:49.654Z","comments":true,"path":"2020/09/27/讀書-把時間當作朋友/","link":"","permalink":"https://peterwe2.github.io/2020/09/27/%E8%AE%80%E6%9B%B8-%E6%8A%8A%E6%99%82%E9%96%93%E7%95%B6%E4%BD%9C%E6%9C%8B%E5%8F%8B/","excerpt":"讀書-把時間當作朋友 picture source: 博客來把時間當作朋友[線上版]在開始這次的讀書總結之前, 想要先講一講怎麼會讀這本-“把時間當作朋友：沒有人能管理時間，你真正能管理的只有你自己“.這是第一次讀李笑來老師的書, 最一開始的時候是從 github上看到李笑來的主頁, 發現了好多不可多得的文章!(或許一方面是我書讀太少哈哈), 也滿推薦大家去逛逛李笑來的 github.講的都是平常比較少看到的見解, 也點出很多盲點值得反思, 正好最近需要一本跟時間管理有關的資料來閱讀, 就選了”把時間當作朋友”, 下面摘要幾個自己主觀覺得有用的重點.","text":"讀書-把時間當作朋友 picture source: 博客來把時間當作朋友[線上版]在開始這次的讀書總結之前, 想要先講一講怎麼會讀這本-“把時間當作朋友：沒有人能管理時間，你真正能管理的只有你自己“.這是第一次讀李笑來老師的書, 最一開始的時候是從 github上看到李笑來的主頁, 發現了好多不可多得的文章!(或許一方面是我書讀太少哈哈), 也滿推薦大家去逛逛李笑來的 github.講的都是平常比較少看到的見解, 也點出很多盲點值得反思, 正好最近需要一本跟時間管理有關的資料來閱讀, 就選了”把時間當作朋友”, 下面摘要幾個自己主觀覺得有用的重點. (一) 時間跟管理從這本書的最前面, 作者就點出一個被大家誤解的盲點: “時間是不可能被管理的”, 必須靠自己想辦法控制自己的腦袋,讓累積去解決所有時間管理的問題, “對的事情持續的做”, 就可以發現時間自己跑來跟你做朋友但是我自己經常的會有一個問題即是: “計畫好了很多要執行的目標, 卻仍然在中途過於浮躁而最終讓計畫失敗”的情況,這讓我十分困擾, 那書中提到可以嘗試的是, 告訴自己”速成絕無可能”, “只有付出才有收穫”等等, 讓自己的潛意識也能夠吸收這個”讓自己腳踏實地”的認知;接著由於需要完成的任務會很大或是很多, 可以將大的任務切割成小的任務, 在預定計畫的時候把幾個任務分組, 每次完成一組就做一個總結, 並且給予自己獎勵, 增加持續下去的動力.漸漸的會讓執行力提升!然而在面對特別無聊且會讓自己反感的任務時, 更需要把計畫任務做得更謹慎, 否則沒有堅持下去就會白費, 所以必須告訴自己”這個會很枯燥, 不過會有越來越多收穫!” (二) 批判性思考另外, 在書中也談到了關於”獨立思考”的重要性, 在接收任何新知的同時, 把它和腦中的現存的認知做比較, 並且多方的查證, 避免自己被別人任意的左右, 一個原則就是”人家說什麼你就信什麼, 挺傻的!”認清自己是弱的, 謙虛的澄清與精進更多知識, 讓自己慢慢變強;之後還會再讀一本跟批判性思維有關的書 (三) 探討與交流同時在與他人交流, 必須當個好的傾聽者, 站在對方的立場思考, 即使不完全同意對方的立場, 也可以在對方講完的時候進行討論, 並且要認真的聽對方說話,避免辯論成為吵架, 整個討論就會成為毫無意義而且浪費時間 (四) 學習的誤區在學習的過程中, 總會在班上遇到幾個功課特別好的同學, 那其實本質上彼此的差距並不是那麼大, 最大的在於後天的努力:”策略”和”堅持”還有一個滿有印象的概念就是, 因為大腦是善於遺忘痛苦的, 所以當我們在背單字, 學習的時候如果讓自己處於一個太痛苦的環境下, 大腦就會在不久的將來, 自動把這些讀過的東西和痛苦聯想起來, 分類到”資源回收桶”, 之後又要重讀了, 造成怎樣都很難學起來的低效率情況, 所以可以試著讓自己是愉快的學習或太痛苦就先終止. (五) 積累萬能最後, 包括個人個習慣, 思維, 只要保持一個原則”凡事都不過是靠積累”, 相信積累的人往往更容易獲得自己的目標! 碎念最近看了比較多跟”軟實力”有關的書, 對於”硬技術”的書可能又要queue不知到什麼時候才要開始消化…","categories":[],"tags":[]},{"title":"讀書-刻意練習","slug":"讀書-刻意練習","date":"2020-09-10T14:21:20.000Z","updated":"2020-09-10T14:32:15.767Z","comments":true,"path":"2020/09/10/讀書-刻意練習/","link":"","permalink":"https://peterwe2.github.io/2020/09/10/%E8%AE%80%E6%9B%B8-%E5%88%BB%E6%84%8F%E7%B7%B4%E7%BF%92/","excerpt":"刻意練習 筆記我想這本書最想表達的是教育的重要性吧。在這本書裡面多次的舉例，反覆的說明只要使用對的方法，是很有可能達到該領域的高手的，並且還在最後面說明高手之所以能夠表現得如此頂尖，跟所謂天生的”天賦”毫無關連性。","text":"刻意練習 筆記我想這本書最想表達的是教育的重要性吧。在這本書裡面多次的舉例，反覆的說明只要使用對的方法，是很有可能達到該領域的高手的，並且還在最後面說明高手之所以能夠表現得如此頂尖，跟所謂天生的”天賦”毫無關連性。 而作者也提到”信念”的重要，必須相信自己能夠達到頂尖的水準。他舉了例子說明潛移默化的效果，小孩在成年之前受到的鼓勵與負面的詞句都會影響發展，跟未來發展最有關連性的只可能是你的”興趣”，因為比較喜歡某個領域，所以花了特別多時間跟努力去鑽研，久而久之就成為了高手，但離頂尖還有點距離，也就是”訓練方法”的差異。同時也要讓自己擁有該領域的”心智表徵”，即是頂尖的人在那個領域發揮的時候是怎麼思考的? 從基礎開始累積，這顆雪球就會越滾越大，延伸出更多的相關的思維模式，所以刻意練習就是要練出強大的”心智表徵”。關於刻意練習的原則，包含了使用長期、大量時間的練習，並且不只是無腦一直練，而是有一套練習方法，同時在練習的過程中可以獲得他人的回饋，進行檢討，修正錯誤，再練習，這個過程無疑是很枯燥的，必須在一開始的時候就認清”成為強者”就要忍受無聊的事實，否則很容易半途而廢，而這種枯燥卻正好會嚇跑很多人，所以”良好的引導”和”適時的獎勵”也成為了刻意練習的催化劑。如果沒有辦法找到專家如老師，也能夠多參考別人的經驗進行訓練，看看其他強者是經歷了什麼才變成頂尖的高手的。","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2020-08-16T09:51:08.225Z","updated":"2020-08-16T15:17:51.905Z","comments":true,"path":"2020/08/16/hello-world/","link":"","permalink":"https://peterwe2.github.io/2020/08/16/hello-world/","excerpt":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"test","slug":"test","date":"2020-07-16T14:02:45.000Z","updated":"2020-08-16T15:17:51.799Z","comments":true,"path":"2020/07/16/test/","link":"","permalink":"https://peterwe2.github.io/2020/07/16/test/","excerpt":"TEST1printf(&quot;hello\\n&quot;);","text":"TEST1printf(&quot;hello\\n&quot;);","categories":[],"tags":[]},{"title":"讀書 - Soft Skills 軟實力","slug":"讀書-Soft-Skills-軟實力","date":"2020-05-17T14:27:00.000Z","updated":"2020-08-16T15:17:51.799Z","comments":true,"path":"2020/05/17/讀書-Soft-Skills-軟實力/","link":"","permalink":"https://peterwe2.github.io/2020/05/17/%E8%AE%80%E6%9B%B8-Soft-Skills-%E8%BB%9F%E5%AF%A6%E5%8A%9B/","excerpt":"Soft Skills 軟實力｜軟體開發人員的生存手冊 (Soft Skills: The software developer’s life manual)ISBN: 9864766384 內容摘要在這本書裡面，主要介紹了軟體開發人員的職涯中，可以以什麼樣的方法與技巧去面對可能會遭遇到的非技能相關的主題。同樣的，我們必須越早知道除了coding之外，還需要培養一些技巧去優化”人生”這個程式，在讀完之後，紀錄一下一些整理的重點和想法。","text":"Soft Skills 軟實力｜軟體開發人員的生存手冊 (Soft Skills: The software developer’s life manual)ISBN: 9864766384 內容摘要在這本書裡面，主要介紹了軟體開發人員的職涯中，可以以什麼樣的方法與技巧去面對可能會遭遇到的非技能相關的主題。同樣的，我們必須越早知道除了coding之外，還需要培養一些技巧去優化”人生”這個程式，在讀完之後，紀錄一下一些整理的重點和想法。 關於職涯以前上學的期間環境跟上班的環境截然不同，在工作的時候遇到想都沒想過的問題是很正常的，不過要如何能夠迎刃而解這些問題，才是真正重要的，比如自己要一輩子當碼農嗎? 有辦法突破嗎? 又或者怎樣可以提升自己的生產力，為工作帶來更高的價值? 很認同作者表示履歷不該只是一張紙，當有機會為 open source 貢獻的時候、自己的 side project 做的很有意思，這些作品集才能真正的體現出經歷，而不以時間說明自己的工作經驗。 四大主題除了專業技能之外，還必須要認真的經營未來會跟著自己一輩子的: 身體健康、社交生活、財務管理、學習能力 關於健康，曾經在網路上看過一個公式: 成就 = 身體健康 * 你付出的一切，所以保持運動的習慣、正常的飲食，讓身體能夠有好精神，在做任何事情都事半功倍，也不忘要維持mental health，我認同這個為第一重要。每天都可以慢跑個半小時，順便舒緩一天上班的疲憊，增加多巴胺，讓腦袋更快樂! 關於社交生活，跟家人聊天，找同學朋友打屁，維繫人與人之間的感情也是特別重要的，在講話的過程中，也可以訓練說話邏輯的能力，同時訓練溝通的能力，這也會為自己帶來優勢，避免成為工程師中的孤狼。 關於理財，有句話說 你不理財，財不理你，或許成為軟體工程師不能讓你發大財，但是幫自己做好財務的管理，是一個必須養成的習慣，比如記帳可以記錄過去花了多少錢，在做檢討的時候，可以避免自己再次的衝動消費，比如投資，當累積了一筆閒錢，能夠拿去讓”錢自己賺錢”，有計畫的花錢與存錢，才是真正的讓薪水變成喜歡的樣子。 關於學習能力，活到老學到老，尤其對於軟體工程師特別重要，在開發的過程中很容易會遇到目前在用的工具已經過時或是需要更新等等，那勢必要因應趨勢去了解並學習新的工具，即使不是要追趕最新的項目，擁有一套高效的學習套路，在任何領域和時機都能夠派上用場，比如碰到一個從前都沒有遇到過的領域，那麼要如何讓自己短時間上手? 上手之後又要如何熟練? 結語書中還有很多topic沒有在這邊提出來，很推薦大家把這本書看完，即使你會覺得這些東西好像是廢話，不過對於工作才1年的菜雞－我來說，在目前的職涯遇到一些迷惘的時候，這本生存手冊確實給了不少實用的建議。","categories":[],"tags":[]},{"title":"macOS Magic Trackpad settings","slug":"macOS-Magic-Trackpad-settings","date":"2020-04-14T12:06:00.000Z","updated":"2020-08-16T15:18:42.431Z","comments":true,"path":"2020/04/14/macOS-Magic-Trackpad-settings/","link":"","permalink":"https://peterwe2.github.io/2020/04/14/macOS-Magic-Trackpad-settings/","excerpt":"macOS Magic Trackpad settingsmagic your trackpad. Open “System Preferences” Trackpad","text":"macOS Magic Trackpad settingsmagic your trackpad. Open “System Preferences” Trackpad Accessibility","categories":[],"tags":[]},{"title":"2019 Review, 從學生到職場","slug":"2019-review-從學生到職場","date":"2019-12-31T02:03:00.000Z","updated":"2020-08-16T15:17:51.799Z","comments":true,"path":"2019/12/31/2019-review-從學生到職場/","link":"","permalink":"https://peterwe2.github.io/2019/12/31/2019-review-%E5%BE%9E%E5%AD%B8%E7%94%9F%E5%88%B0%E8%81%B7%E5%A0%B4/","excerpt":"2019 Review, 從學生到職場1. 前言 時間過得真快, 轉眼已經2019年底這一年真正的從學校步入社會離開無憂無慮的學生舒適圈開始現實社會中生存的菜雞生涯工作了8個多月, 在這裡紀錄今年發生的一些回顧和心得","text":"2019 Review, 從學生到職場1. 前言 時間過得真快, 轉眼已經2019年底這一年真正的從學校步入社會離開無憂無慮的學生舒適圈開始現實社會中生存的菜雞生涯工作了8個多月, 在這裡紀錄今年發生的一些回顧和心得 2. 工作找工作在退伍後剛好過年, 在2019的2月底才開始找工作因為研究所的時候主要在做的領域就是 LTE/ 5G 相關, 在找職缺的時候也就投遞許多相關的職位同時也將目標職缺放廣到C/ C++, Linux, network且軟體或韌體等等都可以嘗試期間也是不停的蒐集各種相關的面試經驗, 筆試題目, 面試題目, 還要不停的修改與完善個人簡歷面完一間還要檢討每次哪裏可以講的更好更順,在面試期間的中後期開始還要考慮哪些機會必須先放棄以及哪些必須要想個理由請公司方等待尤其是在收到公司來的邀約信還需要安排時間跟舟車勞頓後來面試了21個, 有7個offer get, 命中率偏低 QQ在面試了大概6個禮拜後, 結束求職之旅, 終於找到了我的第一份工作! 社畜人生關於開始上班之後就從第一天到職的時候說起吧最大的不一樣在於以前還是學生的時候每到一個新環境就會有前輩為新人迎新的活動等等而在公司這, 就少了那份歡迎的感覺畢竟大家來到公司也只是為了討生活 不過或許是我們這個部門比較特別, 大家很”避暑”沒什麼閒聊等等(大家人都很nice, 也很強, 只是不愛聊天XD)但也不完全是缺點, 不會有那種大家都在幹嘛所以我也必須幹嘛的壓力只是社交生活大概就等於0 haha其餘的時候都跟研究所的時候滿像的而由於我們這個部門的產品在公司中算是新的目前也沒有什麼 deadline 的壓力, 完全就是 research 階段也就不太需要加班,真995(早上9點到公司, 每天工時9小時, 每周工作5天).在上班時間主管不太會去要求必須做什麼, 主要任務就是把現有的文檔跟 source code摸熟可能是要做的東西太新, 主管大部分的時候真的不太派其他事情給我, 大多都是幫忙測試東西這半年多來, 認為自己在找新東西來研究的能力有所提升, 也拜讀了很多軟體工程前輩的優質文章找了不少有趣的 topic, 之後整理整理, 希望2020可以找時間來好好研究 3. 生活在高雄南漂了6年(大學4年+研究所2年), 完成了學業2018/10 一拿到畢業證書就先入伍受訓4個月(許多長輩好像挺好奇4個月能幹嘛, 改天再發一篇仔細的回顧, 之前根本想都不想回想XD)然後才真正的搬回到北部老家其實不太習慣比起大學的時候, 在研究所的時候更多時候都是自己一個人相處從實驗室回到租屋處就是想做什麼就做什麼, 不太會有人管,時間上的規劃更為自由回到家裡就是要顧慮家人的感受, 比如電動不能打太晚, 要一起分擔很多家事, 要跟大家一起吃飯等等(而且特別想念在高雄的許多宵夜….)但整體來說過著挺規律的生活 4. 目標“投資自己還是有最大的報酬率”2019的時候沒立什麼flag唯一一個大目標就是找到一份work life balance 的工作很幸運的自己認為是達到了但是看了很多大前輩的老人言: software engineer 就是必須活到老學到老, 學海無涯在上班之後有一些小目標但是沒有達到: 看完兩本書並寫總結, 完成資料結購的複習並寫下學習紀錄 每周固定運動至少3天只有完成: 學習coursera 的 learning how to learn總歸來講還是需要培養自己的自制力 -&gt; attention management還有一些壞習慣必須剔除: 晚睡, 划太多手機看雜訊, 泡在影集中 希望2020可以完成: 固定看書寫下總結的習慣: mindmap+ 知識沉澱 每周固定運動的習慣 寫一點 leetcode 活動腦袋 培養 writing skills: 能夠做出高質量的文檔 finance management: 開始練習”投資” 學python 經營 github issue blog (這是第一篇haha), 寫雜記, 技術文章, 完成一兩個 side project 5. 總結“機會是留給準備好的人”現在的自己還沒辦法成為想要成為的那種人看了很多一流大公司的前輩分享生活與工作確實是很羨慕, 也知道了自己還有很多的不足希望自己可以在未來一年中, 每一天都能更加進步 順便賣一下家裡的老大","categories":[],"tags":[]}],"categories":[],"tags":[]}